Tekla Open API Reference for Tekla Structures 2025
Detail.Status Property
 The read only status of the detail. The status can be reported and shown in drawings. The color of the detail symbol in the model indicates the status of the detail.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectionStatusEnum Status { get; }
Public ReadOnly Property Status As ConnectionStatusEnum
	Get
Property Value
Type: ConnectionStatusEnum
See Also
Reference
Detail Class
Tekla.Structures.Model Namespace